In [2]:
# Importing pandas and numpy Libraries
import pandas as pd
import numpy as np

In [18]:
# Defining Dataframe objects
Student1 = pd.DataFrame({'StudentID': [111, 222], 'Name':['Daryl', 'Negan'], 'Level':[3, 4]})
Student1

   StudentID   Name  Level
0        111  Daryl      3
1        222  Negan      4

In [19]:
Activities1 = pd.DataFrame({'StudentID': [111, 222, 111], 'Activity': ['Hockey', 'Cricket', 'Chess']})
Activities1

   StudentID Activity
0        111   Hockey
1        222  Cricket
2        111    Chess

In [20]:
Student1.merge(Activities1) # Merge using StudentID

   StudentID   Name  Level Activity
0        111  Daryl      3   Hockey
1        111  Daryl      3    Chess
2        222  Negan      4  Cricket

In [31]:
First_cols = pd.DataFrame({'Com1': ['A', 'B', 'C'],'Com2': ['P', 'Q', 'R'], 'Num1': [111, 222, 333]})
First_cols

  Com1 Com2  Num1
0    A    P   111
1    B    Q   222
2    C    R   333

In [36]:
Second_cols = pd.DataFrame({'Com1':  ['A', 'B', 'C'],'Com2': ['P', 'T', 'R'], 'Num2': [444, 555, 666]}) 
Second_cols

  Com1 Com2  Num2
0    A    P   444
1    B    T   555
2    C    R   666

In [37]:
Second_cols.merge(First_cols)

  Com1 Com2  Num2  Num1
0    A    P   444   111
1    C    R   666   333

In [38]:
# Merging with specific keys.
Second_cols.merge(First_cols, on='Com1') # Com1 is key

  Com1 Com2_x  Num2 Com2_y  Num1
0    A      P   444      P   111
1    B      T   555      Q   222
2    C      R   666      R   333

In [40]:
Second_cols.merge(First_cols, on=['Com1', 'Com2']) # Com1 and Com2 is key

  Com1 Com2  Num2  Num1
0    A    P   444   111
1    C    R   666   333